Revit 2024 API
DividedSurface Class
 An element that represents a mesh on the surface of another element, a family instance, an import instance or a geometry combination, and a tile pattern built on that mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DividedSurface : Element
Visual Basic
Public Class DividedSurface _
	Inherits Element
Visual C++
public ref class DividedSurface : public Element
Remarks
 The type of this element may be set to: a TilePattern element, a FamilySymbol element from a Curtain Panel family.
Examples
CopyC#
public void TileSurface(Document document, Form form)
{
    // cover surface with OctagonRotate tile pattern
    TilePatterns tilePatterns = document.Settings.TilePatterns;
    foreach (Reference r in DividedSurface.GetReferencesWithDividedSurfaces(form))
    {
        DividedSurface ds = DividedSurface.GetDividedSurfaceForReference(document, r);
        ds.ChangeTypeId(tilePatterns.GetTilePattern(TilePatternsBuiltIn.OctagonRotate).Id);
    }
}
CopyVB.NET
Public Sub TileSurface(document As Document, form As Form)
    ' cover surface with OctagonRotate tile pattern
    Dim tilePatterns As TilePatterns = document.Settings.TilePatterns
    For Each r As Reference In DividedSurface.GetReferencesWithDividedSurfaces(form)
        Dim ds As DividedSurface = DividedSurface.GetDividedSurfaceForReference(document, r)
        ds.ChangeTypeId(tilePatterns.GetTilePattern(TilePatternsBuiltIn.OctagonRotate).Id)
    Next
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DividedSurface
See Also
DividedSurface Members
Autodesk.Revit.DB Namespace